
lati = {'셔틀콕': 37.298748, '제1공학관': 37.297579, 
        '제3공학관': 37.297442, '제4공학관': 37.296845,
        '제1학술관': 37.298245, '컨퍼런스홀': 37.299030,
        '제2과학기술관': 37.298603, '학생복지관': 37.298023,
        '학생회관': 37.297468, '학술정보관': 37.296775,
        '제5공학관': 37.296884, '창업보육센터': 37.295587,
        '학연산 클러스터': 37.296398, '기숙사 셔틀콕': 37.293088}

longti = {'셔틀콕': 126.838021, '제1공학관': 126.837431, 
          '제3공학관': 126.836229, '제4공학관': 126.836250,
          '제1학술관': 126.835864, '컨퍼런스홀': 126.836830,
          '제2과학기술관': 126.837216, '학생복지관': 126.834437,
          '학생회관': 126.834737, '학술정보관': 126.835214,
          '제5공학관': 126.837381, '창업보육센터': 126.837231,
          '학연산 클러스터': 126.838883, '기숙사 셔틀콕': 126.835827}

def loca(spot):
    return [lati[spot],longti[spot]]

